# 과제_0709

Q. 데이터프레임 df1, df2를 생성하고 첫번째 행을 r1, r2에 첫번째 열을 c1, c2에 저장한 후 다음 연산을 수행하세요.
- df1 + df2
- df1 - r1
- df1 - c1

In [1]:
import numpy as np
import pandas as pd

a = np.arange(12)
df1 = pd.DataFrame(a.reshape(3,4))
df2 = pd.DataFrame(a.reshape(3,4))

r1 = df1.iloc[0] # df1의 첫 번째 행
c1 = df1[0] # df1의 첫 번째 열

r2 = df2.iloc[0]
c2 = df2[0]

df1

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [2]:
# df1 + df2

df1+df2

    0   1   2   3
0   0   2   4   6
1   8  10  12  14
2  16  18  20  22

In [3]:
# df1 - r1
df1 - r1

   0  1  2  3
0  0  0  0  0
1  4  4  4  4
2  8  8  8  8

In [4]:
# df1 - c1
df1.sub(c1,axis=0) ### 계산을 행방향으로 하므로 axis = 0 으로

   0  1  2  3
0  0  1  2  3
1  0  1  2  3
2  0  1  2  3

In [5]:
### 만약 그대로 df1-c1을 하게 되면, 1행3열로 들어가서 빼고, 4열은 없으므로 NaN값이 됨.
df1-c1

     0    1    2   3
0  0.0 -3.0 -6.0 NaN
1  4.0  1.0 -2.0 NaN
2  8.0  5.0  2.0 NaN

Q. 덧셈, 곱셈, 뺄셈 경우도 연산 사례 수행  
rdiv() : 역수로 나누는 것

In [6]:
### 역수. 1/df1
df1.rdiv(1)

       0         1         2         3
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [7]:
### 3+df1
df1.radd(3)

    0   1   2   3
0   3   4   5   6
1   7   8   9  10
2  11  12  13  14

In [8]:
### 3*df1
df1.rmul(3)

    0   1   2   3
0   0   3   6   9
1  12  15  18  21
2  24  27  30  33

In [9]:
### 3-df1
df1.rsub(3)

   0  1  2  3
0  3  2  1  0
1 -1 -2 -3 -4
2 -5 -6 -7 -8